
#########################################  
# TAPS                                     
#########################################
tap "homebrew/cask" 
tap "homebrew/cask-drivers" 
tap "idleberg/dbxcli" 

#########################################  
# HOMEBREW CASKS                                     
#########################################
cask "appcleaner" 
cask "appcode" 
cask "arduino" 
cask "balenaetcher" 
cask "bettertouchtool" 
cask "bitwarden" 
cask "cleanmymac" 
cask "clion" 
cask "coolterm" 
cask "docker" 
cask "dropbox" 
cask "firefox" 
cask "flux" 
cask "ftdi-vcp-driver" 
cask "intellij-idea" 
cask "iterm2" 
cask "keyboardcleantool" 
cask "mactex-no-gui" 
cask "minecraft" 
cask "nordvpn" 
cask "openemu" 
cask "paintbrush" 
cask "porting-kit" 
cask "protonmail-bridge" 
cask "pycharm" 
cask "silicon-labs-vcp-driver" 
cask "skim" 
cask "slack" 
cask "spotify" 
cask "spotify-notifications" 
cask "steam" 
cask "sublime-merge" 
cask "sublime-text" 
cask "thunderbird" 
cask "ticktick" 
cask "tor-browser" 
cask "ui-browser" 
cask "visual-studio-code" 
cask "xctu" 
cask "xquartz" 

#########################################  
# HOMEBREW FORMULAE                                     
#########################################
brew "balena-cli" 
brew "dbxcli" 
brew "geckodriver" 
brew "gnu-getopt" 
brew "gnupg" 
brew "imagemagick" 
brew "ino" 
brew "jq" 
brew "libusb" 
brew "mas" 
brew "node" 
brew "npm" 
brew "openvpn" 
brew "rsync" 
brew "teensy_loader_cli" 
brew "trash" 
brew "unar" 
brew "wget" 

#########################################  
# APP STORE APPS                                     
#########################################
mas "BetterSnapTool" , id: 417375580
mas "Dark Reader for Safari" , id: 1438243180
mas "Dynamo" , id: 1445910651
mas "Pocket" , id: 568494494
mas "Shazam" , id: 897118787
mas "Wipr" , id: 1320666476
mas "Xcode" , id: 497799835
