
#===================================================================
# BREW BUNDLE FILE
#===================================================================


##################################################
# TAPS
##################################################
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "idleberg/dbxcli"

##################################################
# HOMEBREW CASKS
##################################################
cask "balenaetcher"
cask "bettertouchtool"
cask "bitwarden"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "ftdi-vcp-driver"
cask "iterm2"
cask "keyboardcleantool"
cask "mactex-no-gui"
cask "minecraft"
cask "nordvpn"
cask "openemu"
cask "porting-kit"
cask "protonmail-bridge"
cask "skim"
cask "slack"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "sublime-merge"
cask "ticktick"
cask "visual-studio-code"
cask "xctu"
cask "xquartz"

##################################################
# HOMEBREW FORMULAE
##################################################
brew "dbxcli"
brew "dockutil"
brew "geckodriver"
brew "gnu-getopt"
brew "gnupg"
brew "imagemagick"
brew "jq"
brew "mas"
brew "npm"
brew "platformio"
brew "python"
brew "rsync"
brew "tmux"
brew "trash"
brew "unar"
brew "vim"

##################################################
# APP STORE APPS
##################################################
mas "BetterSnapTool", id: 417375580 # BetterSnapTool
mas "Dark Reader for Safari", id: 1438243180 # Dark Reader for Safari
mas "Dynamo", id: 1445910651 # Dynamo
mas "Pocket", id: 568494494 # Pocket
mas "Shazam", id: 897118787 # Shazam
mas "Wipr", id: 1320666476 # Wipr Adblocker
