tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "idleberg/dbxcli"

brew "clang-format"
brew "coreutils"
brew "idleberg/dbxcli/dbxcli"
brew "dockutil"
brew "enscript"
brew "gcc"
brew "geckodriver"
brew "ghostscript"
brew "gnu-getopt"
brew "gnupg"
brew "gstreamer"
brew "imagemagick"
brew "jq"
brew "libusb"
brew "llvm"
brew "mas"
brew "npm"
brew "pandoc"
brew "python"
brew "perl"
brew "platformio"
brew "rsync"
brew "rust"
brew "tmux"
brew "trash"
brew "unar"
brew "verilator"
brew "vim"
brew "wget"

cask "amethyst"
cask "balenaetcher"
cask "bettertouchtool"
cask "bitwarden"
cask "brave-browser"
cask "discord"
cask "docker"
cask "dropbox"
cask "edrawmax"
cask "eqmac"
cask "firefox"
cask "flux"
cask "homebrew/cask-drivers/ftdi-vcp-driver"
cask "google-chrome"
cask "iterm2"
cask "keyboardcleantool"
cask "mactex-no-gui"
cask "minecraft"
cask "nordvpn"
cask "openemu"
cask "rectangle"
cask "skim"
cask "slack"
cask "spotify"
cask "steam"
cask "sublime-merge"
cask "sublime-text"
cask "ticktick"
cask "visual-studio-code"
cask "xctu"
cask "xquartz"

mas "Dark Reader for Safari", id: 1438243180
mas "Dynamo", id: 1445910651
mas "Pocket", id: 568494494
mas "Shazam", id: 897118787
mas "Wipr", id: 1320666476
mas "Xcode", id: 497799835
