appcleaner
appcode
arduino
balenaetcher
bettertouchtool
bitwarden
cleanmymac
clion
coolterm
discord
docker
dropbox
firefox
flux
homebrew/cask-drivers/ftdi-vcp-driver
intellij-idea
iterm2
keyboardcleantool
mactex-no-gui
minecraft
nordvpn
openemu
paintbrush
porting-kit
protonmail-bridge
pycharm
homebrew/cask-drivers/silicon-labs-vcp-driver
skim
slack
spotify
spotify-notifications
steam
sublime
sublime-merge
thunderbird
ticktick
tor-browser
ui-browser
vagrant
virtualbox
visual-studio-code
xctu
xquartz
