tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "idleberg/dbxcli"
tap "zegervdv/zathura"
tap "koekeishiya/formulae"
tap "elsorino/homebrew-elso"

brew "clang-format"
brew "coreutils"
brew "idleberg/dbxcli/dbxcli"
brew "dockutil"
brew "enscript"
brew "gcc"
brew "geckodriver"
brew "ghostscript"
brew "gnu-getopt"
brew "gnupg"
brew "gstreamer"
brew "imagemagick"
brew "jq"
brew "libusb"
brew "llvm"
brew "mas"
brew "npm"
brew "pandoc"
brew "python"
brew "perl"
brew "platformio"
brew "rsync"
brew "rust"
brew "tmux"
brew "trash"
brew "unar"
brew "verilator"
brew "vim"
brew "wget"
brew "neofetch"
brew "ranger"
brew "youtube-dl"
brew "figlet"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "pipes-sh"
brew "zathura"
brew "zathura-pdf-poppler"
brew "sc-im"
brew "balena-cli"
brew "tty-clock"
brew "gotop"
brew "asciiquarium"
brew "htop"
brew "lf"


cask "bitwarden"
cask "brave-browser"
cask "discord"
cask "docker"
cask "dropbox"
cask "edrawmax"
cask "eqmac"
cask "firefox"
cask "flux"
cask "homebrew/cask-drivers/ftdi-vcp-driver"
cask "google-chrome"
cask "keyboardcleantool"
cask "mactex-no-gui"
cask "minecraft"
cask "nordvpn"
cask "openemu"
cask "skim"
cask "slack"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "ticktick"
cask "visual-studio-code"
cask "xctu"
cask "xquartz"
cask "elsorino/homebrew-elso/macfeh"
cask "iina"
cask "alacritty"
cask "kitty"
cask "coolterm"

mas "Dark Reader for Safari", id: 1438243180
mas "Dynamo", id: 1445910651
mas "Pocket", id: 568494494
mas "Shazam", id: 897118787
mas "Wipr", id: 1320666476
mas "Xcode", id: 497799835
