tap "cmacrae/formulae"                                   #
tap "homebrew/cask"                                      #
tap "homebrew/cask-drivers"                              #
tap "homebrew/cask-fonts"                                #
tap "homebrew/services"                                  #
tap "koekeishiya/formulae"                               #
tap "zegervdv/zathura"                                   #

brew "asciiquarium"                                      # showing off
brew "autojump"                                          # python formatter
brew "balena-cli"                                        #
brew "bat"                                               # cat alternative with syntax highlight (for file manager)
brew "bc"                                                # terminal calculator
brew "calc"                                              # terminal calculator
brew "calcurse"                                          #
brew "ccat"                                              # cat alternative with syntax highlight (for file manager)
brew "chafa"                                             # terminal graphics
brew "clang-format"                                      #
brew "cliclick"                                          # emulate mouse motion
brew "cmacrae/formulae/spacebar", args: ["HEAD"]         # status bar for osx
brew "coreutils"                                         #
brew "dmenu"
brew "docker"                                            #
brew "docker-credential-helper"                          #
brew "docker-machine"                                    # required for docker
brew "dockutil"                                          # tool for configuring osx dock
brew "enscript"                                          # for converting code to postscript
brew "figlet"                                            # for writing ascii text
brew "fzf"                                               #
brew "gcc"                                               #
brew "geckodriver"                                       #
brew "ghostscript"                                       # for ps2pdf
brew "glow"                                              # terminal markdown highlighting
brew "gnu-getopt"                                        #
brew "gnu-typist"                                        #
brew "gnuplot"                                           # graph plotting
brew "go"                                                # golang
brew "gotop"                                             #
brew "gpg"                                               #
brew "gptfdisk"                                          # crucial for quickly fixing apfs partition hexcode
brew "highlight"                                         # cat alternative with syntax highlight (for file manager)
brew "htop"                                              #
brew "imagemagick"                                       #
brew "jq"                                                #
brew "jupyterlab"                                        #
brew "koekeishiya/formulae/skhd" , restart_service: true #
brew "koekeishiya/formulae/yabai", restart_service: true #
brew "lf"                                                #
brew "libusb"                                            #
brew "llvm"                                              #
brew "lolcat"                                            # make printed output colorful
brew "media-info"                                        # display data for audio/video (for file manager)
brew "mpv"                                               # for playing videos
brew "ncdu"
brew "neofetch"                                          #
brew "neovim", args: ["HEAD"]                            #
brew "newsboat"                                          # terminal RSS feed
brew "openssl"                                           # required for generating crypt(3) passwords
brew "pandoc"                                            #
brew "pass"                                              # password store
brew "pfetch"                                            # lightweight system info tool
brew "pidof"                                             # used by pywal
brew "pipes-sh"                                          #
brew "platformio"                                        # massive embedded development suite
brew "poppler"                                           # for pdftotext and pdftoppm
brew "python"                                            #
brew "redshift"                                          #
brew "ripgrep"                                           # searcher used with vim
brew "rsync"                                             #
brew "sc-im", args: ["HEAD"]                             #
brew "screenfetch"                                       # another system info tool, probably the slowest
brew "the_silver_searcher"                               # searcher used with vim
brew "tmux"                                              #
brew "trash-cli"                                         # send items to trash from temrinal
brew "tty-clock"                                         #
brew "unar"                                              #
brew "verilator"                                         #
brew "wget"                                              #
brew "youtube-dl"                                        #
brew "zegervdv/zathura/zathura"                          # document reader
brew "zegervdv/zathura/zathura-pdf-poppler"              # zathura pdf dependency
brew "zsh-autosuggestions"                               #
brew "zsh-syntax-highlighting"                           #
brew "xorriso"                                           # for making custom ubuntu preseed

cask "alacritty"                                         # fast terminal
cask "coolterm"                                          # serial port gui for arduino, see https://docs.platformio.org/en/latest/faq.html?highlight=coolterm#advanced-serial-monitor-with-ui
cask "discord"                                           #
cask "dmenu-mac"                                         #
cask "firefox"                                           #
cask "fliqlo"                                            # screensaver
cask "font-dejavusansmono-nerd-font"                     # a font
cask "font-fira-code-nerd-font"                          # a font
cask "font-hack-nerd-font"                               # a font
cask "font-robotomono-nerd-font"                         # a font
cask "font-saucecodepro-nerd-font"                       # a font
cask "font-ubuntumono-nerd-font"                         # a font
cask "homebrew/cask-drivers/ftdi-vcp-driver"             # arduino driver
cask "inkscape"                                          # for latex drawings
cask "librepcb"                                          # electrical schematic drawing tool
cask "mactex-no-gui"                                     # latex bundle
cask "minecraft"                                         #
cask "spotify"                                           #
cask "virtualbox"                                        # required for docker
cask "xctu"                                              #
cask "xquartz"                                           # for rendering ssh windows
cask "zoomus"                                            #
