balenaetcher
bettertouchtool
bitwarden
brave-browser
coolterm
discord
docker
dropbox
edrawmax
eqmac
firefox
flux
ftdi-vcp-driver
google-chrome
keyboardcleantool
mactex-no-gui
minecraft
nordvpn
openemu
skim
slack
spotify
sublime-merge
sublime-text
ticktick
visual-studio-code
xctu
xquartz
elsorino/homebrew-elso/macfeh
iina
alacritty
kitty
